app/Controllers/Logins.php

SELECT *
FROM `users`
WHERE `email` = 'tester@gmail.com'
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $model = new UserModel();

        // Ambil input dari form
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        // Cari pengguna berdasarkan email
        $user = $model->where('email', $email)->first();