app/Controllers/Products.php

    public function index()
    {
        $productModel = new ProductModel();
        $data['products'] = $productModel->findAll(); // Mengambil semua data produk
---
SELECT *
FROM `products`

    public function edit($id)
    {
        $productModel = new ProductModel();
        $data['product'] = $productModel->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '29'

    public function update($id)
    {
        $productModel = new ProductModel();
        $product = $productModel->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '29'

            'category' => $this->request->getPost('category'),
            'image' => $newName
        ];
        $productModel->update($id, $data);
---
UPDATE `products` SET `product_name` = 'Laptop', `price` = '15000000.00', `description` = 'Laptop gaming terbaik', `category` = 'Electronics', `image` = '1733484206_2488f38956e8914fb135.jpg'
WHERE `products`.`id` IN ('29')